Repository: hfukuchi/SPDX_specification
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: File derived from external product: Package A contains multiple files derived from an outside project. Rather than use the artifactOf* attributes (Sections 4.9­4.11) to describe the relation of these files to their project, the outside project can be represented by another package, Package B, whose FilesAnalyzed attribute is set to “false”. Each of the binary files can then have a relationship to package B (Section 6). This allows the outside project to be represented by a single SPDX identifier (the identifier of Package B).
ja: 外部製品から派生したファイル：Package Aは、外部製品から派生した複数のファイルを含む。これらのファイルとプロジェクトの関係を記述するのにartifactOf*属性（4.9­4.11節）を使うよりも、外部プロジェクトは他のパッケージPackage Bで表現できる。Package BのFile Analyzed属性は“false”にする。バイナリーファイルは、パッケージBと関係を持つ。（6節）これは、外部プロジェクトを1つのSPDX識別子（Package Bの識別子）で表現することを可能にする。

source: File derived from external product: Package A contains multiple files derived from an outside project.
ja: 外部製品から派生したファイル：Package Aは、外部製品から派生した複数のファイルを含む。

source: Files Analyzed
ja: Files Analyzed（解析したファイル）

source: For example, Sourceforge is a host website, not a supplier, the supplier for http://sourceforge.net/projects/bridge/ is "The Linux Foundation."
ja: たとえば、Sourceforgeはウェブサイト ホストであり、提供者ではない。http://sourceforge.net/projects/bridge/の提供者は”The Linux Foundation"である。

source: For example, the SPDX file identifies the package glibc and Red Hat as the Package Supplier, but Free Software Foundation is the Package Originator.
ja: たとえば、SPDXファイルはglibcパッケージとそのパッケージ供給者Red Hatを特定するが、パッケージ原作者はFree Software Foundationである。

source: For example, the URI can be a URL referencing the SPDX document itself, if it is available on the internet.
ja: たとえば、インターネット上でアクセス可能であれば、URIは、SPDX文書自体を参照するURLとして作成できる。

source: For example, the URI can be a URL referencing the SPDX document itself, if it is available on the internet. A best practice for creating the URI for SPDX documents available on the public internet is http://[CreatorWebsite]/[pathToSpdx]/[DocumentName]­[UUID]
ja: たとえば、インターネット上でアクセス可能であれば、URIは、SPDX文書自体を参照するURLとして作成できる。インターネットで公にアクセス可能なSPDX文書のURIを作成するベストプラクティスは以下である。http://[CreatorWebsite]/[pathToSpdx]/[DocumentName]­[UUID]

source: For example, this field might include comments indicating whether the package was pulled from a source code management system or has been repackaged.
ja: たとえば、このフィールドには、パッケージがソースコード管理システムから引き出されたとか、再パッケージされたというコメントを記載してもよい。

source: Format Requirements
ja: フォーマットに対する要求

source: Here are the supported forms:
ja: サポートする形式は以下である。

source: How the data stored in an SPDX file is used by the recipient.
ja: SPDXファイルに保管されたデータの受け手側の利用方法

source: If a grouping, like a set of files in a subdirectory, is being treated as a package, the subdirectory name may be appropriate to provide.
ja: サブディレクトリ内のファイルセットのようなグルーピングがパッケージとして扱われる場合には、サブディレクトリ名を提供するのが適切である。

source: If multiple participants or tools were involved, use multiple instances of this field.
ja: 複数の関係者やツールがある場合には、このフィールドを複数使用する。

source: If set to “false”, the package must not contain any files.
ja: “false”にセットされた場合には、パッケージは一切ファイルを含んではいけない。

source: If the Concluded License is not the same as the Declared License, a written explanation should be provided in the Comments on License field (section 3.15).
ja: もし、Concluded License（結論されたライセンス）がDeclared License（宣言されたライセンス）と異なる場合、Comments on License（ライセンスへのコメント、3.15節参照）フィールドに説明を記載すべきである。

source: If the SPDX document is updated, thereby creating a new version, a new URI for the updated document must be used.
ja: SPDX文書が更新され、新しいバージョンが作成された時には、更新された文書に新しいURIを使わなければならない。

source: If the SPDX document is updated, thereby creating a new version, a new URI for the updated document must be used. There can only be one URI for an SPDX document and only one SPDX document for a given URI.
ja: SPDX文書が更新され、新しいバージョンが作成された時には、更新された文書に新しいURIを使わなければならない。SPDX文書には1つのURIだけが対応し、与えられたURIには1つの文書だけが対応する。

source: If the SPDX file is to be included in a package, this value should not be calculated.
ja: SPDXファイルがパッケージに含まれる場合には、この値は計算されるべきではない。

source: If the SPDX file was created by an individual, indicate the person's name.
ja: SPDXファイルが個人によって作成されて場合には、個人の名前を表記する。

source: If the SPDX file was created on behalf of a company or organization, indicate the entity name.
ja: SPDXファイルが企業もしくは組織を代表して作成された場合には、組織名を表記する。

source: If the SPDX file was created using a software tool, indicate the name and version for that tool.
ja: SPDXファイルがツールによって作成された場合には、ツールの名前とバージョンを表記する。

source: If the SPDX file was created by an individual, indicate the person's name. If the SPDX file was created on behalf of a company or organization, indicate the entity name.
ja: SPDXファイルが個人によって作成されて場合には、個人の名前を表記する。SPDXファイルが企業もしくは組織を代表して作成された場合には、組織名を表記する。

source: If the creator does not own their own website, a default SPDX CreatorWebsite and PathToSpdx can be used 'spdx.org/spdxdocs'.
ja: 作成者が自分のウェブサイトを保有していない場合には、CreatorWebsiteとPathToSpdxのデフォルト値（'spdx.org/spdxdocs'）が利用可能である。

source: If “false” indicates packages that represent metadata or URI references to a project, product, artifact, distribution or a component.
ja: “false”の場合、プロジェクト、製品、生成物、頒布またはコンポーネントを参照するメタデータやURIを示す。

source: In Tag:value format this is delimited by <text> ..
ja: Tag:value フォーマットでは、これは<text> ..

source: In Tag:value format this is delimited by <text>..</text>, in RDF, it is delimited by <rdfs:comment>.
ja: Tag:value フォーマットでは<text> .. </text>で分離され、RDFでは<rdfs:comment>で分離される。

source: In Tag:value format this is delimited by <text>..</text>, in RDF, it is delimited by<rdfs:comment>.
ja: Tag:value フォーマットでは<text> .. </text>で分離され、RDFでは<rdfs:comment>で分離される。

source: In Tag:value format this is delimited by <text>..</text>.
ja: Tag:value フォーマットでは、これは<text>..</text>で分離される。

source: In VCS location compact notations, the trailing slashes in <host_name>, <path_to_repository> are not significant.
ja: VCS位置簡潔表記では、<host_name>や<path_to_repository>の中の最後のスラッシュは重要でない。

source: In many cases, the URI will point to a web accessible document, but this should not be assumed to be the case.
ja: 多くの場合、URIは文書を入手できるウェブサイトを示しているが、これがすべて該当するとは限らない。

source: In some cases a package may be created and originally distributed by a different third party than the Package Supplier of the package.
ja: ある場合には、パッケージ供給者とは別の第3者が、パッケージを作成し最初に頒布していることがある。

source: In tag:value format, the order in which package and files occur is syntactically significant.
ja: tag:valueフォーマットでは、パッケージとファイルの置かれる順番は構文的に重要である。

source: In this case, Package A may be defined with its File Analyzed attribute set to “false”.
ja: このケースでは、パッケージAのFile Analyzed属性を“false”となる。

source: In this case, Package A may be defined with its File Analyzed attribute set to “false”. Package A includes External Document References to SPDX documents containing Packages referenced in all the available relationships.
ja: このケースでは、パッケージAのFile Analyzed属性を“false”となる。パッケージAは、可能なすべての関係の中で参照されたパッケージを含むSPDX文書へのExternal Document References（外部文書参照）を含む。

source: In VCS location compact notations, the trailing slashes in <host_name>, <path_to_repository> are not significant. Leading and trailing slashes in <sub_path> are not significant.
ja: VCS位置簡潔表記では、<host_name>や<path_to_repository>の中の最後のスラッシュや、<sub_path>の中の最初と最後のスラッシュは重要でない。

source: Information that cannot be derived from an inspection (whether manual or using automated tools) of the package to be analyzed.
ja: 解析対象パッケージの検査（手動、自動を問わず）からは得られない情報

source: Intent:
ja: 意図：

source: Intent: Here, the name of each document is an important convention and easier to refer to than the URI.
ja: 意図：文書名は重要な慣例であり、URIより簡単な参照方法である。

source: Intent: Here, the name of each package is an important conventional technical identifier to be maintained for each package.
ja: 意図：各パッケージの名前は、パッケージを保守するために使用される重要で慣習的な技術識別子である。

source: Intent: Here, the time stamp can serve as an indication as to whether the analysis needs to be updated.
ja: 意図：タイムスタンプは、解析の更新が必要かどうかの基準になりうる。

source: Intent: Here, where and how to download the exact package being referenced is critical verification and tracking data.
ja: 意図：参照されているパッケージとまさに同じものをどこからどのようにダウンロードするかは、検証と追跡のための重要なデータである。

source: Intent: Recognizing that licenses are added to the SPDX License List with each subsequent version, the intent is to provide recipients of the SPDX file with the version of the SPDX License List used. This anticipates that in the future, an SPDX file may have used a version of the SPDX License List that is older than the then current one.
ja: 意図：バージョン更新時にSPDXライセンス リストにライセンスが加えられることを認識した上で、SPDXファイルの受領者に使用されたSPDXライセンス ファイルのバージョンを提供することを意図している。このことは、将来、現行のものより古いバージョンのSPDXライセンス リストがSPDXで使用されることを見越している。

source: Intent: SPDX elements within this document may be related to other SPDX elements referenced from external SPDX documents. An SPDX element could be a snippet, file, package, license reference or SPDX document.
ja: 意図：この文書内で参照されるSPDX要素は、外部SPDX文書から参照される他のSPDX要素に関連しているかもしれない。SPDX要素としては、コード断片、ファイル、パッケージ、ライセンス参照、SPDX文書がありうる。

source: Intent: The URI provides an unambiguous mechanism for other SPDX documents to reference SPDX elements within this SPDX document.
ja: 意図：URIは、他のSPDX文書がこのSPDX文書内にあるSPDX要素を参照するための明確なメカニズムを提供する。

source: Intent: There may be several versions of the same package within an SPDX document.
ja: 意図：SPDX文書内に、同一パッケージの複数バージョンがありうる。

source: Intent: A package can refer to a project, product, artifact, distribution or a component that is external to the SPDX document.
ja: 意図：パッケージは、SPDX文書の外部にあるプロジェクト、製品、作成物、頒布あるいはコンポーネントを参照できる。

source: Intent: Here, by providing a comment field, the SPDX file creator can provide additional information to describe any anomalies or discoveries in the determination of the origin of the package.
ja: 意図：コメントフィールドを提供することで、SPDXファイル作成者は、変則的な事項やオリジナル パッケージを確定での発見などの追加コメントを提供できる。

source: Intent: Here, by providing a link to the package's home page, the SPDX file creator can provide additional information useful for analysis.
ja: 意図：SPDXファイル作成者によってパッケージ ホームページへのリンクが提供されることで、解析に有益な追加情報が提供されたことになる。

source: Intent: Here, by providing a unique identifier of the package, confusion over which version or modification of a specific package the SPDX file references should be eliminated.
ja: 意図：パッケージの一意の識別子を提供することで、SPDXファイルが参照する特定のパッケージのバージョンや変更間の混乱が軽減されるはずである。

source: Intent: Here, parties exchanging information in accordance with SPDX specification need to provide 100% transparency as to which SPDX specification such information is conforming to.
ja: 意図：SPDX仕様に従って情報交換するパーティは、情報がどのSPDX仕様に従っているかを100%透明にする必要がある。

source: Intent: Here, the actual file name of the compressed file containing the package may be a significant technical element that needs to be included with each package identification information.
ja: 意図：パッケージを含む圧縮ファイルの実ファイル名は、パッケージ識別情報と一緒に含まれる必要がある、重要な技術要素である。

source: Intent: Here, the generation method will assist the recipient of the SPDX file in assessing the general reliability/accuracy of the analysis information.
ja: 意図：作成方法を知ることは、SPDXファイルの受領者が解析情報の全般的な信頼性・正確度を評価する助けとなる。

source: Intent: Here, the intent is for the SPDX file creator to analyze the license information in package, and other objective information, e.g., COPYING file, together with the results from any scanning tools, to arrive at a reasonably objective conclusion as to what license governs the package.
ja: 意図：SPDXファイル作成者がパッケージ内のライセンス情報や他の客観的情報（たとえばCOPYINGファイル）とスキャンツール結果とを合わせて解析を行い、パッケージに適用されるライセンスは何かについて合理的に客観性のある結論に到達すること。

source: Intent: Here, the intent is to provide readers/reviewers with comments by the creator of the SPDX file about the SPDX document.
ja: 意図：読者やレビュアーにSPDXファイル作成者からのSPDXファイルについてのコメントを提供する。

source: Intent: Here, the intent is to provide recipients of the SPDX file with comments by the creator of the SPDX file.
ja: 意図：SPDXファイル受領者にSPDXファイル作成者のコメントを提供する。

source: Intent: Here, the intention is to capture all license information detected in the actual files.
ja: 意図：実際のファイルかで検出される全ライセンス情報を把握すること。

source: Intent: Here, the name of each package is an important conventional technical identifier to be maintained for each
ja: 意図：各パッケージの名前は、パッケージを保守するために使用される重要で慣習的な技術識別子である。

source: Intent: Here, where and how to download the exact package being referenced is critical verification and tracking
ja: 意図：参照されているパッケージとまさに同じものをどこからどのようにダウンロードするかは、検証と追跡のための重要なデータである。

source: Intent: Providing a unique identifier based on the files inside each package, eliminates confusion over which version or modification of a specific package the SPDX file refers to.
ja: 意図：各パッケージに含まれるファイルに基づいた一意の識別子を提供する。これは、SPDXファイルが参照する特定のパッケージのバージョンや変更間の混乱を減らす。

source: Intent: Recognizing that licenses are added to the SPDX License List with each subsequent version, the intent is to provide recipients of the SPDX file with the version of the SPDX License List used.
ja: 意図：バージョン更新時にSPDXライセンス リストにライセンスが加えられることを認識した上で、SPDXファイルの受領者に使用されたSPDXライセンス ファイルのバージョンを提供することを意図している。

source: Intent: SPDX elements within this document may be related to other SPDX elements referenced from external SPDX documents.
ja: 意図：この文書内で参照されるSPDX要素は、外部SPDX文書から参照される他のSPDX要素に関連しているかもしれない。

source: Intent: The versioning of a package is a useful for identification purposes and for indicating later changes of the package version.
ja: 意図：パッケージへのバージョン付けは、パッケージの特定とパッケージバージョンの後での変更を示すのに役立つ。

source: Intent: This field assists with understanding the point of distribution for the code in the package.
ja: 意図：このフィールドは、パッケージ内のコードの頒布点を理解するのを助ける。

source: Intent: This field assists with understanding the point of origin of the code in the package.
ja: 意図：このフィールドは、パッケージ中のコードの頒布点を理解するのを助ける。

source: Intent: This is to alleviate any concern that content (the data or database) in an SPDX file is subject to any form of intellectual property right that could restrict the re-use of the information or the creation of another SPDX file for the same project(s).
ja: 意図：SPDXに含まれる内容物（データやデータベース）が情報の再利用や同じプロジェクトに対して別のSPDXファイルを作成することを制限しうる知的財産権の影響下にあるかもしれないという懸念を軽減する。

source: Intent: This is to alleviate any concern that content (the data or database) in an SPDX file is subject to any form of intellectual property right that could restrict the re?use of the information or the creation of another SPDX file for the same project(s).
ja: 意図：SPDXに含まれる内容物（データやデータベース）が情報の再利用や同じプロジェクトに対して別のSPDXファイルを作成することを制限しうる知的財産権の影響下にあるかもしれないという懸念を軽減する。

source: Intent: Here, the actual file name of the compressed file containing the package may be a significant technical element that needs to be included with each package identification information. If a grouping, like a set of files in a subdirectory, is being treated as a package, the subdirectory name may be appropriate to provide.
ja: 意図：パッケージを含む圧縮ファイルの実ファイル名は、パッケージ識別情報と一緒に含まれる必要がある、重要な技術要素である。サブディレクトリ内のファイルセットのようなグルーピングがパッケージとして扱われる場合には、サブディレクトリ名を提供するのが適切である。

source: Intent: This is to alleviate any concern that content (the data or database) in an SPDX file is subject to any form of intellectual property right that could restrict the re­use of the information or the creation of another SPDX file for the same project(s).
ja: 意図：SPDXに含まれる内容物（データやデータベース）が情報の再利用や同じプロジェクトに対して別のSPDXファイルを作成することを制限しうる知的財産権の影響下にあるかもしれないという懸念を軽減する。

source: Interoperability with an annotate Tag:value format and the RDF format will be preserved.
ja: 注釈付きタグ値フォーマットとRDFフォーマットの相互運用性は保持されなければならない

source: It also allows the relationship(s) between the outside project and each of the files be represented in much more detail.
ja: それは、また、外部プロジェクトと各ファイルの関係を詳細に表現することを可能にする。

source: It also permits one to embed the SPDX file within the package without altering the identifier.
ja: これは、識別子を変更することなく、パッケージにSPDXファイルを挿入することが可能になる。

source: It is only intended to provide a unique ID.
ja: 一意のIDを与えるためだけに使われている。

source: It may also be a loosely organized manifest of references to Packages
ja: それは製品やプロジェクトに換券するパッケージへの参照をゆるく集めたリストでもよい。

source: It may also be a loosely organized manifest of references to Packages involved in a product or project.
ja: それは製品やプロジェクトに換券するパッケージへの参照をゆるく集めたリストでもよい。

source: It provides the necessary information for forward and backward compatibility for processing tools.
ja: ツールの前方後方互換性のために必要な情報を提供する。

source: It will enable both future changes to the specification and to support backward compatibility.
ja: 仕様の将来の変更と後方互換性を可能にする。

source: Leading and trailing slashes in <sub_path> are not significant.
ja: <sub_path>の中の最初と最後のスラッシュは重要でない。

source: Legal interpretation of the licenses or any compliance actions that have been or may need to be taken.
ja: ライセンスの法的解釈や、実施済みや実施すべきコンプライアンス活動

source: License List Version
ja: License List Version（ライセンス リスト バージョン）

source: M is major version number N is minor version number.
ja: Mはメジャー バージョン番号 Nはマイナー バージョン番号。

source: MM is month with leading zero DD is day with leading zero
ja: MM は月（左0詰め） DD は日（左0詰め）

source: Miscellaneous bug fixes as reported on the mailing list and reported in bugs.linuxfoundation.org (search for SPDX specification).
ja: メーリングリストやbugs.linuxfoundation.org（SPDX仕様を検索）にて報告された雑多の不具合修正。

source: Must be in a human readable form.
ja: 人間によって可読でなければならない

source: Must be in a syntax that a software tool can read and write.
ja: ソフトウェア ツールが読み書きできる構文で記述されなければならない

source: Must be suitable to be checked for syntactic correctness independent of how it was generated (human or tool).
ja: 作成方法（人手やツール）に依存せず、構文チェックに適していなければならない

source: Must permit automated specification syntax validation.
ja: 仕様が使う構文は自動検証が可能でなければならない

source: Note that the SPDX documents are not currently stored or accessible on this website.
ja: URIは、アクセス可能である必要はないことに注意。

source: Note that the SPDX documents are not currently stored or accessible on this website. The URI is only used to create a unique ID following the above conventions.
ja: SPDX文書は、現在このウェブサイトで保管されておらず入手できないことに注意。URIは、上記の慣習に従うために、一意のIDを生成するために利用されている。

source: Note that the URI does not have to be accessible.
ja: URIは、アクセス可能である必要はないことに注意。

source: Notes: in RDF, a namespace can be created for the external document reference if a short form name for the external reference is desired.
ja: 注：RDFでは、外部参照に短形式の名前が必要な場合は、外部文書参照のために名前空間を作成できる。

source: One instance is required for each SPDX file produced.
ja: SPDXファイルごとに一つのインスタンスが必要である。

source: One instance of the Package Information is required per package being described.
ja: 記述されるパッケージごとに1つのパッケージ情報インスタンスが必要である。

source: One instance is required for each SPDX file produced. It provides the necessary information for forward and backward compatibility for processing tools.
ja: SPDXファイルごとに一つのインスタンスが必要である。ツールの前方後方互換性のために必要な情報を提供する。

source: Other Licensing Information Detected: A way to capture information about and refer to licenses that are not on the SPDX License List .
ja: Other Licensing Information Detected（検出された他ライセンス情報）：SPDXライセンス リストにないライセンスに対する検出方法や参照情報

source: Overview of SPDX 2.1 document contents.
ja: SPDX文書コンテンツの概要

source: Package A includes External Document References to SPDX documents containing Packages referenced in all the available relationships.
ja: パッケージAは、可能なすべての関係の中で参照されたパッケージを含むSPDX文書へのExternal Document References（外部文書参照）を含む。

source: Package Checksum
ja: Package Checksum（パッケージチェックサム）

source: Package Download Location
ja: Package Download Location（パッケージ ダウンロード位置）

source: Package File Name
ja: Package File Name（パッケージ ファイル名）

source: Package Home Page
ja: Package Home Page（パッケージ ホーム ページ）

source: Package Information: Facts that are common properties of the entire package.
ja: Package Information（パッケージ情報）：パッケージ全体が共通に有する事実

source: Package Name
ja: Package Name（パッケージ名）

source: Package Originator
ja: Package Originator（パッケージ原作者）

source: Package SPDX Identifier
ja: Package SPDX Identifier（パッケージSPDX識別子）

source: Package Supplier
ja: Package Supplier（パッケージ提供者）

source: Package Verification Code
ja: Package Verification Code（パッケージ検証コード）

source: Package Version
ja: Package Version（パッケージ バージョン）

source: Package relation to external product: Package A can have a STATIC_LINK relationship to Package B, but the binary representation of Package B is furnished by the build process and thus not contained in the file list of Package A. In this case, Package B needs to be defined with its Files Analyzed attribute set to false and all the other attributes subject to the subsequently defined constraints.
ja: 外部製品へのパッケージ関係：Package Aは、Package Bとの間でSTATIC_LINK関係を持つことができるが、Package Bのバイナリー表現は、ビルド プロセスによって与えられるので、Package Aのファイル リストには含まれない。このケースでは、Package BのFilesAnalyzed属性はfalse、他のすべての属性は後で定義される制限にしなければならない。

source: Package Information
ja: Package Information（パッケージ情報）

source: Packages are now able to associate with an “External Reference” which allows a Package to reference an external source of additional information, metadata, enumerations, asset identifiers, or downloadable content believed to be relevant to the Package.
ja: 追加情報、メタデータ、要素列挙（Enumeration）やパッケージに関連すると考えられるダウンロード可能なコンテンツについての外部ソースへの参照を許す「外部参照」をパッケージに関連付けることができる。

source: PathToSpdx is a path to where SPDX documents are stored on the website (e.g.
ja: PathToSpdxは、ウェブサイト上でSDPX文書が置かれた場所へのパスである。(例

source: Person name or organization name may be designated as “anonymous” if appropriate.
ja: そうする方がふさわしい場合には、個人名や組織名を“anonymous”（匿名）にしてもよい。

source: Purpose: Identify any external SPDX documents referenced within this SPDX
ja: 目的：このSPDX文書内で参照されている外部SPDX文書を特定する

source: Purpose: Identify name of this document as designated by
ja: 目的：作成者によって付けられた文書名を特定する

source: Purpose: Identify the full name of the package as given by Package
ja: 目的：Package Originator（パッケージ原作者）によって与えられたパッケージのフルネームを特定する。

source: Purpose: Identify the version of the package.
ja: 目的：パッケージのバージョンを特定する。

source: Purpose: Identify who (or what, in the case of a tool) created the SPDX file.
ja: 目的：誰が（ツールの場合は、何が）SPDXファイルを作成したかを特定する。

source: Purpose: If the package identified in the SPDX file originated from a different person or organization than identified as Package Supplier (see section 3.5 above), this field identifies from where or whom the package originally came. In some cases a package may be created and originally distributed by a different third party than the Package Supplier of the package. For example, the SPDX file identifies the package glibc and Red Hat as the Package Supplier, but Free Software Foundation is the Package Originator.
ja: 目的：SPDXファイルで特定されるパッケージがPackage Supplier（パッケージ供給者）（3.5節参照）で記述されたのとは別の人や組織が原作者である場合、このフィールドはパッケージが誰があるいはどこで最初に作られたかを特定する。ある場合には、パッケージ供給者とは別の第3者が、パッケージを作成し最初に頒布していることがある。たとえば、SPDXファイルはglibcパッケージとそのパッケージ供給者Red Hatを特定するが、パッケージ原作者はFree Software Foundationである。

source: Purpose: Indicates whether the file content of this package has been available for or subjected to analysis when creating the SPDX document. If “false” indicates packages that represent metadata or URI references to a project, product, artifact, distribution or a component. If set to “false”, the package must not contain any files.
ja: 目的：このパッケージのファイルが入手可能であるか、またはSPDX文書作成時に解析対象になっていたかを示す。“false”の場合、プロジェクト、製品、生成物、頒布またはコンポーネントを参照するメタデータやURIを示す。“false”にセットされた場合には、パッケージは一切ファイルを含んではいけない。

source: Purpose: This section identifies the download Universal Resource Locator (URL), or a specific location within a version control system (VCS) for the package at the time that the SPDX file was created.
ja: 目的：このセクションは、SPDXファイル作成時にパッケージが置かれていたダウンロードUniversal Resource Locator (URL)またはバージョン コントロール システム（VCS）内の位置を特定する。

source: Purpose: An optional field for creators of the SPDX file content to provide comments to the consumers of the SPDX document.
ja: 目的：SPDXファイル作成者がSPDXファイル受領者にコメントを提供するための任意フィールド。

source: Purpose: An optional field for creators of the SPDX file to provide general comments about the creation of the SPDX file or any other relevant comment not included in the other fields.
ja: 目的：SPDXファイル作成者が、SPDXファイル作成に関する全般的なコメントや、他のフィールドに含まれない関連コメントを提供するための任意フィールド。
